---
kind: type
id: T:Autodesk.Revit.UI.TaskDialogResult
source: html/bde54cc2-a445-8610-0ced-1851f04eea18.htm
---
# Autodesk.Revit.UI.TaskDialogResult

Enum to specify the task dialog result.

## Syntax (C#)
```csharp
public enum TaskDialogResult
```